// 阿拉伯语
import type { LangMap } from "../lang";


const ar: Partial<LangMap> = {
  "Fast sync": "التركيز على تقديم ملحق مزامنة الملاحظات بدون إزعاج، وسلس بشكل حريري، ومزامنة في الوقت الفعلي عبر منصات متعددة للمستخدمين، يدعم منصات Mac وWindows وAndroid وiOS وغيرها، ويقدم دعمًا متعدد اللغات.",
  "同步全部笔记(覆盖远端)": "مزامنة كافة الملاحظات (استبدال البيانات البعيدة)",
  "同步全部笔记": "مزامنة جميع الملاحظات",
  "远端": "بعيد",
  "接口配置信息已经粘贴到设置中!": "تم لصق معلومات تكوين الواجهة في الإعدادات!",
  "未检测到配置信息!": "لم يتم اكتشاف معلومات التكوين!",
  "远端服务搭建与选择": "إعداد واختيار الخدمات البعيدة",
  "选择一个适合自己的远端": "اختر مستودعاً بعيداً يناسبك",
  "方式": "طريقة",
  "说明": "توضيح",
  "详情参考": "يرجى مراجعة التفاصيل",
  "私有服务搭建": "إنشاء خدمات خاصة",
  "速度好, 自由配置, 无隐私风险": "سرعة جيدة، قابلية التخصيص، لا يوجد خطر على الخصوصية",
  "粘贴的远端配置": "تكوين الوجهة الملصقة",
  "启用自动同步": "تمكين المزامنة",
  "关闭后您的笔记将不做任何同步": "بعد الإغلاق، لن تتم مزامنة ملاحظاتك بأي شكل من الأشكال",
  "远端服务地址": "عنوان الخدمة البعيدة",
  "选择一个 Fast note sync service 服务地址": "اختر عنوان خدمة Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "أدخل عنوان باب بوابة Image API الخاص بك",
  "远端服务令牌": "رمز الخدمة البعيدة",
  "用于远端服务的访问授权令牌": "رمز تصريح الوصول للخدمات عن بُعد",
  "输入您的 API 访问令牌": "أدخل رمز الوصول الخاص بواجهة برمجة التطبيقات",
  "远端仓库名": "اسم المستودع البعيد",
  "支持": "دعم",
  "捐赠": "تبرع",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "إذا كنت تحب هذه الإضافة، يرجى التفكير في التبرع لدعم استمرار التطوير.",
  "Buy me a coffee at ko-fi.com": "اشتر لي قهوة في ko-fi.com",
  "复制 Debug 信息": "انسخ معلومات Debug",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "انسخ معلومات التصحيح إلى الحافظة، قد تحتوي على معلومات حساسة!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "لفتح وحدة التحكم باستخدام اختصار لوحة المفاتيح، يمكنك رؤية سجل هذا الملحق والملحقات الأخرى.",
}

export default ar;
