// 白俄罗斯语
import type { LangMap } from "../lang";


const be: Partial<LangMap> = {
  "Fast sync": "Сярэдчыць на прадастаўленне карыстальнікам бясстрымнага, шаўкавістых, рэальнага часу сінхранізаванага на некалькіх платформах плагіна для сінхранізацыі нататнікаў, які падтрымлівае платформы Mac, Windows, Android, iOS і іншыя, а таксама прапануе шматмоўную падтрымку.",
  "同步全部笔记(覆盖远端)": "Сінхранізаваць усе нататкі (перазапісаць на аддаленай прыладзе)",
  "同步全部笔记": "Сінхранізаваць усе нататкі",
  "远端": "Адалёны端",
  "接口配置信息已经粘贴到设置中!": "Інтэрфэйс канфігурацыйнай інфармацыі быў устаўлены ў налады!",
  "未检测到配置信息!": "Канфігурацыйная інфармацыя не знойдзена!",
  "远端服务搭建与选择": "Аддаленае наладжванне і выбар сэрвісу",
  "选择一个适合自己的远端": "Абярыце прыдатны дыстанцыйны.",
  "方式": "спосаб",
  "说明": "тлумачэнне",
  "详情参考": "Падрабязнасці глядзіце",
  "私有服务搭建": "Прыватная служба настройка",
  "速度好, 自由配置, 无隐私风险": "Хуткасць добрая, свабодная канфігурацыя, няма рызыкі канфідэнцыяльнасці",
  "粘贴的远端配置": "ўстаўлены аддалены канфігурацыі",
  "启用自动同步": "Уключыць сінхранізацыю",
  "关闭后您的笔记将不做任何同步": "Пасля закрыцця вашыя нататкі не будуць сінхранізавацца",
  "远端服务地址": "Адрас аддаленай службы",
  "选择一个 Fast note sync service 服务地址": "Выберыце адрас службы Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "Увядзіце ваш адрас Image API Gateway",
  "远端服务令牌": "Аддалены токен сэрвісу",
  "用于远端服务的访问授权令牌": "Дазволены токен для доступу да дыстанцыйнага абслугоўвання",
  "输入您的 API 访问令牌": "Увядзіце ваш токен доступу API",
  "远端仓库名": "Аддаленая назва сховішча",
  "支持": "падтрымка",
  "捐赠": "ахвяраванне",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Калі вам падабаецца гэты плагін, калі ласка, падумайце аб ахвяраванні для падтрымкі далейшай распрацоўкі.",
  "Buy me a coffee at ko-fi.com": "Купіце мне каву на ko-fi.com",
  "复制 Debug 信息": "Капіруйце Debug інфармацыю",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "Скапіруйце адладкавую інфармацыю ў буфер абмену, гэта можа ўтрымліваць канфідэнцыйную інфармацыю!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Каб адкрыць кансоль з дапамогай спалучэння клавіш, вы можаце ўбачыць журналы гэтага плагіна і іншых плагінаў.",
}

export default be;
