// 希伯来语
import type { LangMap } from "../lang";


const he: Partial<LangMap> = {
  "Fast sync": "ממוקד במתן חוויית משתמש ללא הפרעות, סנכרון חלק בזמן אמת בין מכשירים, תוסף סנכרון הערות התומך בפלטפורמות כמו Mac, Windows, Android, iOS ועוד, עם תמיכה רב-לשונית.",
  "同步全部笔记(覆盖远端)": "סנכרן את כל ההערות (החלף את התוכן המרוחק)",
  "同步全部笔记": "סנכרן את כל ההערות",
  "远端": "מרחוק",
  "接口配置信息已经粘贴到设置中!": "מידע תצורת הממשק כבר הודבק להגדרות!",
  "未检测到配置信息!": "לא זוהתה תצורת מידע!",
  "远端服务搭建与选择": "הקמה ובחירה של שירותים מרוחקים",
  "选择一个适合自己的远端": "בחר רימוט מתאים עבורך",
  "方式": "דרך",
  "说明": "הַנחָיָה",
  "详情参考": "פרטים ניתן למצוא",
  "私有服务搭建": "הקמת שירות פרטי",
  "速度好, 自由配置, 无隐私风险": "מהירות טובה, תצורה חופשית, ללא סיכון לפרטיות",
  "粘贴的远端配置": "הגדרות הקצה שהודבקו",
  "启用自动同步": "הפעל סנכרון",
  "关闭后您的笔记将不做任何同步": "לאחר הסגירה, הפתקים שלכם לא יסונכרנו",
  "远端服务地址": "כתובת שירות מרוחק",
  "选择一个 Fast note sync service 服务地址": "בחר כתובת שירות Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "אנא הזן את כתובת שער ה-API של התמונה שלך",
  "远端服务令牌": "אסימון שירות מרוחק",
  "用于远端服务的访问授权令牌": "אסימון אישור גישה לשירותים מרוחקים",
  "输入您的 API 访问令牌": "הזן את אסימוני גישה של ה-API שלך",
  "远端仓库名": "שם מאגר מרוחק",
  "支持": "תמיכה",
  "捐赠": "תרומה",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "אם אתה נהנה מהתוסף הזה, שקול לתרום לתמיכה בפיתוח המתמשך.",
  "Buy me a coffee at ko-fi.com": "קנה לי קפה ב-ko-fi.com",
  "复制 Debug 信息": "העתק מידע לניפוי שגיאות",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "העתקת מידע הנדסה לאחור ללוח, עשויה להכיל מידע רגיש!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "כדי לפתוח את הקונסולה באמצעות קיצורי מקלדת, אתה יכול לראות את הלוגים של התוסף הזה ותוספים אחרים.",
}

export default he;
