// 日语
import type { LangMap } from "../lang";


const ja: Partial<LangMap> = {
  "Fast sync": "ユーザーに邪魔されず、シルクのようにスムーズで多端末リアルタイム同期のノート同期プラグインを提供することに専念しており、Mac、Windows、Android、iOS などのプラットフォームをサポートし、多言語サポートを提供しています。",
  "同步全部笔记(覆盖远端)": "すべてのノートを同期（リモートを上書きする）",
  "同步全部笔记": "すべてのノートを同期",
  "远端": "リモート",
  "接口配置信息已经粘贴到设置中!": "インターフェース設定情報は既に設定に貼り付けられています!",
  "未检测到配置信息!": "構成情報が検出されませんでした！",
  "远端服务搭建与选择": "リモートサービスの構築と選択",
  "选择一个适合自己的远端": "自分に合ったリモートを選ぶ",
  "方式": "方式",
  "说明": "説明",
  "详情参考": "詳細を参照",
  "私有服务搭建": "プライベートサービスの構築",
  "速度好, 自由配置, 无隐私风险": "速度が良く、自由に設定でき、プライバシーのリスクがない",
  "粘贴的远端配置": "リモート設定のペースト",
  "启用自动同步": "同期を有効にする",
  "关闭后您的笔记将不做任何同步": "閉じた後、ノートは同期されません。",
  "远端服务地址": "リモートサービスアドレス",
  "选择一个 Fast note sync service 服务地址": "Fast note sync service サービスアドレスを選択する",
  "输入您的 Fast note sync service 服务地址": "イメージ API ゲートウェイのアドレスを入力してください",
  "远端服务令牌": "リモートサービストークン",
  "用于远端服务的访问授权令牌": "リモートサービス用のアクセス許可トークン",
  "输入您的 API 访问令牌": "APIアクセス トークンを入力してください",
  "远端仓库名": "リモートリポジトリ名",
  "支持": "サポート",
  "捐赠": "寄付",
  "如果您喜欢这个插件，请考虑捐贈以支持继续开发。": "このプラグインが気に入ったら、開発を継続するために寄付をご検討ください。",
  "Buy me a coffee at ko-fi.com": "コーヒーを買ってください ko-fi.com で",
  "复制 Debug 信息": "デバッグ情報をコピー",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "デバッグ情報をクリップボードにコピーする、機密情報が含まれる可能性があります!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "ショートカットキーでコンソールを開くと、このプラグインや他のプラグインのログを見ることができます。",
  "开始同步": "同期を開始",
  "同步完成": "同期完了",
}

export default ja;
