// 韩语
import type { LangMap } from "../lang";


const ko: Partial<LangMap> = {
  "Fast sync": "사용자에게 방해받지 않고 부드럽고 여러 기기에서 실시간 동기화되는 메모 동기화 플러그인을 제공하며, Mac, Windows, Android, iOS 등의 플랫폼을 지원하고 다국어 지원을 제공합니다.",
  "同步全部笔记(覆盖远端)": "모든 노트 동기화(원격 덮어쓰기)",
  "同步全部笔记": "모든 노트 동기화하기",
  "远端": "원격",
  "接口配置信息已经粘贴到设置中!": "인터페이스 구성 정보가 설정에 이미 붙여넣어졌습니다!",
  "未检测到配置信息!": "구성 정보를 감지하지 못했습니다!",
  "远端服务搭建与选择": "원격 서비스 구축 및 선택",
  "选择一个适合自己的远端": "자신에게 맞는 원격을 선택하세요.",
  "方式": "방식",
  "说明": "설명",
  "详情参考": "자세한 사항은 참고하세요",
  "私有服务搭建": "개인 서비스 구축",
  "速度好, 自由配置, 无隐私风险": "속도가 좋고, 자유롭게 구성 가능하며, 개인정보 위험이 없습니다.",
  "粘贴的远端配置": "붙여넣은 원격 구성",
  "启用同步": "동기화 활성화",
  "关闭后您的笔记将不做任何同步": "닫은 후에는 귀하의 노트가 동기화되지 않습니다.",
  "远端服务地址": "원격 서비스 주소",
  "选择一个 Fast note sync service 服务地址": "Fast note sync service 서비스 주소 선택",
  "输入您的 Fast note sync service 服务地址": "Image API Gateway 주소를 입력하세요",
  "远端服务令牌": "원격 서비스 토큰",
  "用于远端服务的访问授权令牌": "원격 서비스에 대한 액세스 권한 부여 토큰",
  "输入您的 API 访问令牌": "API 액세스 토큰을 입력하세요.",
  "远端仓库名": "원격 저장소 이름",
  "支持": "지원",
  "捐赠": "기부",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "이 플러그인이 마음에 드신다면 계속 개발을 지원하기 위해 기부를 고려해 주세요.",
  "Buy me a coffee at ko-fi.com": "ko-fi.com에서 나에게 커피를 사주세요",
  "复制 Debug 信息": "디버그 정보 복사",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "디버그 정보를 클립보드에 복사하기, 민감한 정보가 포함될 수 있습니다!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "단축키를 통해 콘솔을 열면 이 플러그인과 다른 플러그인의 로그를 볼 수 있습니다.",
  "开始同步": "동기화 시작",
  "同步完成": "동기화 완료",
}

export default ko;
