// 尼泊尔语
import type { LangMap } from "../lang";


const ne: Partial<LangMap> = {
  "Fast sync": "प्रयोगकर्तालाई बिना बाधा, रेशमी रूपले चिक्नो, विभिन्न उपकरणमा वास्तविक समय समिकरण नोट समिकरण प्लगइन उपलब्ध गराउनेमा ध्यान केन्द्रित गरिन्छ, जुन म्याक, विन्डोज, एन्ड्रोइड, आइओएस लगायत अन्य प्लेटफर्महरूलाई समर्थन गर्दछ र बहुभाषी समर्थन प्रदान गर्दछ।",
  "同步全部笔记(覆盖远端)": "सम्पूर्ण नोटहरू समसुकृत गर्नुहोस् (रिमोटलाई अधिलेखन गर्नुहोस्)",
  "同步全部笔记": "सम्पूर्ण नोटहरूको समिकरण गर्नुहोस्",
  "远端": "टाढाको",
  "接口配置信息已经粘贴到设置中!": "सेटिङमा इन्टरफेस कन्फिगरेसन जानकारी पेस्ट भइसकेको छ!",
  "未检测到配置信息!": "कन्फिगरेसन जानकारी फेला परेन!",
  "远端服务搭建与选择": "दूरस्थ सेवा सेटअप र चयन",
  "选择一个适合自己的远端": "आफ्नो लागि उपयुक्त टाढाको चयन गर्नुहोस्",
  "方式": "तरीका",
  "说明": "निर्देशन",
  "详情参考": "विवरणलाई सन्दर्भ गर्नुहोस्।",
  "私有服务搭建": "निजी सेवा सेटअप",
  "速度好, 自由配置, 无隐私风险": "गति राम्रो छ, स्वतन्त्र कन्फिगरेसन, गोपनीयताको कुनै जोखिम छैन।",
  "粘贴的远端配置": "पेस्ट गरिएको टाढाको कन्फिगरेसन",
  "启用自动同步": "सिंक गर्नुहोस् सक्षम गर्नुहोस्",
  "关闭后您的笔记将不做任何同步": "बन्द भएपछि तपाईंको नोटहरू कुनै पनि समकक्षी हुनेछैनन्।",
  "远端服务地址": "दूरस्थ सेवा ठेगाना",
  "选择一个 Fast note sync service 服务地址": "Fast note sync service सेवा ठेगाना चयन गर्नुहोस्।",
  "输入您的 Fast note sync service 服务地址": "तपाईंको छवि एपीआई गेटवे ठेगाना लेख्नुहोस्।",
  "远端服务令牌": "दूरस्थ सेवा टोकन",
  "用于远端服务的访问授权令牌": "दूरस्थ सेवाहरूको लागि पहुँच प्राधिकरण टोकन",
  "输入您的 API 访问令牌": "तपाईंको API पहुँच टोकन प्रविष्ट गर्नुहोस्",
  "远端仓库名": "दूरस्थ भण्डारण नाम",
  "支持": "समर्थन",
  "捐赠": "दान गर्नुहोस्",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "यदि तपाईंलाई यो प्लगइन मन पर्छ भने, कृपया निरन्तर विकासलाई समर्थन गर्न दान गर्न विचार गर्नुहोस्।",
  "Buy me a coffee at ko-fi.com": "को-फी डट कममा मलाई कफी किनिदिनुहोस्",
  "复制 Debug 信息": "डिबग जानकारी प्रतिलिपि गर्नुहोस्।",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "डिबग जानकारी क्लिपबोर्डमा प्रतिलिपि गर्नुहोस्, संवेदनशील जानकारी समावेश गर्न सक्दछ!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "कन्सोल खोल्नको लागि सर्टकट कुञ्जीहरू प्रयोग गरेर, तपाईं यस प्लगइन र अन्य प्लगइनहरूको लग हेर्न सक्नुहुन्छ।",
}

export default ne;
