// 俄语
import type { LangMap } from "../lang";


const ru: Partial<LangMap> = {
  "Fast sync": "Плагин для синхронизации заметок, предоставляющий пользователям возможность беспрепятственной, плавной и многоплатформенной синхронизации в режиме реального времени, поддерживает платформы Mac, Windows, Android, iOS и предлагает поддержку нескольких языков.",
  "同步全部笔记(覆盖远端)": "Синхронизировать все заметки (перезаписать на удаленном хранилище)",
  "同步全部笔记": "Синхронизировать все заметки",
  "远端": "Удаленный",
  "接口配置信息已经粘贴到设置中!": "Информация о конфигурации интерфейса уже вставлена в настройки!",
  "未检测到配置信息!": "Конфигурационная информация не обнаружена!",
  "远端服务搭建与选择": "Настройка и выбор удаленных сервисов",
  "选择一个适合自己的远端": "Выберите подходящий для себя удалённый сервер.",
  "方式": "Способ",
  "说明": "Пояснение",
  "详情参考": "Подробности см.",
  "私有服务搭建": "Настройка частных сервисов",
  "速度好, 自由配置, 无隐私风险": "Скорость хорошая, свободная конфигурация, отсутствие риска для конфиденциальности",
  "粘贴的远端配置": "Вставленные конфигурации удалённого доступа",
  "启用自动同步": "Включить синхронизацию",
  "关闭后您的笔记将不做任何同步": "После закрытия ваши заметки не будут синхронизироваться.",
  "远端服务地址": "Удаленный адрес службы",
  "选择一个 Fast note sync service 服务地址": "Выберите адрес службы Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "Введите адрес вашего Image API Gateway",
  "远端服务令牌": "Токен удалённого сервиса",
  "用于远端服务的访问授权令牌": "Токен авторизации для доступа к удалённым сервисам",
  "输入您的 API 访问令牌": "Введите ваш API токен доступа",
  "远端仓库名": "Удалённое имя хранилища",
  "支持": "поддержка",
  "捐赠": "пожертвование",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Если вам нравится этот плагин, пожалуйста, рассмотрите возможность внести пожертвование для поддержки дальнейшей разработки.",
  "Buy me a coffee at ko-fi.com": "Купи мне кофе на ko-fi.com",
  "复制 Debug 信息": "Скопировать информацию отладки",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "Скопировать отладочную информацию в буфер обмена, может содержать конфиденциальную информацию!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Чтобы открыть консоль с помощью горячих клавиш, вы можете увидеть журналы этого плагина и других плагинов.",
}

export default ru;
