// 泰语
import type { LangMap } from "../lang";


const th: Partial<LangMap> = {
  "Fast sync": "มุ่งเน้นให้บริการปลั๊กอินบันทึกที่ไม่มีการรบกวน ลื่นไหลราวกับผ้าไหม และซิงค์แบบเรียลไทม์ข้ามหลายแพลตฟอร์ม รองรับแพลตฟอร์มต่าง ๆ เช่น Mac, Windows, Android, iOS และมีการสนับสนุนหลายภาษา",
  "同步全部笔记(覆盖远端)": "ซิงค์บันทึกทั้งหมด (แทนที่ระยะไกล)",
  "同步全部笔记": "ซิงค์บันทึกทั้งหมด",
  "远端": "ปลายทาง",
  "接口配置信息已经粘贴到设置中!": "ข้อมูลการกำหนดค่าอินเทอร์เฟซได้ถูกวางในตั้งค่าแล้ว!",
  "未检测到配置信息!": "ไม่พบข้อมูลการกำหนดค่า!",
  "远端服务搭建与选择": "การติดตั้งและการเลือกใช้บริการระยะไกล",
  "选择一个适合自己的远端": "เลือกรีโมทที่เหมาะสมสำหรับตัวเอง",
  "方式": "วิธี",
  "说明": "คำแนะนำ",
  "详情参考": "รายละเอียดเพิ่มเติม",
  "私有服务搭建": "การสร้างบริการส่วนตัว",
  "速度好, 自由配置, 无隐私风险": "ความเร็วดี, ปรับแต่งได้อย่างอิสระ, ไม่มีความเสี่ยงด้านความเป็นส่วนตัว",
  "粘贴的远端配置": "การกำหนดค่าระยะไกลที่วางลง",
  "启用自动同步": "เปิดใช้งานการซิงค์",
  "关闭后您的笔记将不做任何同步": "ปิดแล้วโน้ตของคุณจะไม่ซิงค์ใดๆ",
  "远端服务地址": "ที่อยู่บริการระยะไกล",
  "选择一个 Fast note sync service 服务地址": "เลือกที่อยู่บริการ Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "กรุณาใส่ที่อยู่ Image API Gateway ของคุณ",
  "远端服务令牌": "โทเค็นบริการระยะไกล",
  "用于远端服务的访问授权令牌": "โทเค็นการอนุญาตเข้าถึงสำหรับบริการระยะไกล",
  "输入您的 API 访问令牌": "กรุณาใส่โทเค็นเข้าถึง API ของคุณ",
  "远端仓库名": "ชื่อคลังเก็บระยะไกล",
  "支持": "สนับสนุน",
  "捐赠": "บริจาค",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "หากคุณชอบปลั๊กอินนี้ โปรดพิจารณาบริจาคเพื่อสนับสนุนการพัฒนาต่อไป",
  "Buy me a coffee at ko-fi.com": "ซื้อกาแฟให้ฉันที่ ko-fi.com",
  "复制 Debug 信息": "คัดลอกข้อมูล Debug",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "คัดลอกข้อมูลการดีบักไปยังคลิปบอร์ด อาจมีข้อมูลที่ละเอียดอ่อน!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "คุณสามารถเปิดคอนโซลด้วยปุ่มลัดเพื่อดูบันทึกของปลั๊กอินนี้และปลั๊กอินอื่น ๆ",
}

export default th;
