// 乌克兰语
import type { LangMap } from "../lang";


const uk: Partial<LangMap> = {
  "Fast sync": "Зосередьтеся на наданні користувачам безперебійного, плавного досвіду та миттєвої синхронізації нотаток на різних пристроях, підтримуйте такі платформи, як Mac, Windows, Android, iOS тощо, а також забезпечуйте багатомовну підтримку.",
  "同步全部笔记(覆盖远端)": "Синхронізувати всі нотатки (перезаписати на віддаленому сервері)",
  "同步全部笔记": "Синхронізувати всі нотатки",
  "远端": "віддалений",
  "接口配置信息已经粘贴到设置中!": "Інформація про конфігурацію інтерфейсу вже вставлена в налаштування!",
  "未检测到配置信息!": "Конфігураційні дані не виявлено!",
  "远端服务搭建与选择": "Налаштування та вибір віддалених сервісів",
  "选择一个适合自己的远端": "Виберіть відповідний для себе віддалений сервер.",
  "方式": "спосіб",
  "说明": "Інструкція",
  "详情参考": "Детальна інформація розглядається",
  "私有服务搭建": "Запуск приватних послуг",
  "速度好, 自由配置, 无隐私风险": "Швидкість хороша, вільна конфігурація, без ризику порушення конфіденційності",
  "粘贴的远端配置": "Вставлений віддалений конфігураційний файл",
  "启用自动同步": "Увімкнути синхронізацію",
  "关闭后您的笔记将不做任何同步": "Після закриття ваші нотатки не будуть синхронізовані.",
  "远端服务地址": "Віддалена адреса сервісу",
  "选择一个 Fast note sync service 服务地址": "Виберіть адресу служби Fast note sync service",
  "输入您的 Fast note sync service 服务地址": "Введіть адресу вашого Image API Gateway",
  "远端服务令牌": "Токен служби на віддаленому сервері",
  "用于远端服务的访问授权令牌": "Токен авторизації доступу для віддалених послуг",
  "输入您的 API 访问令牌": "Введіть свій токен доступу API",
  "远端仓库名": "Віддалене ім'я сховища",
  "支持": "підтримка",
  "捐赠": "пожертва",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "Якщо вам подобається цей плагін, будь ласка, розгляньте можливість пожертвування для підтримки подальшої розробки.",
  "Buy me a coffee at ko-fi.com": "Придбай мені каву на ko-fi.com",
  "复制 Debug 信息": "Скопіювати відладку інформації",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "Копіювання налагоджувальної інформації в буфер обміну може містити конфіденційні дані!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "Щоб відкрити консоль за допомогою гарячих клавіш, ви можете побачити журнали цього плагіна та інших плагінів.",
}

export default uk;
