// 简体中文
import type { LangMap } from "../lang";


const zh_cn: Partial<LangMap> = {
  "Fast sync": "可私有化部署，专注为用户提供无打扰、丝般顺滑、多端实时同步的笔记同步插件，支持 Mac、Windows、Android、iOS 等平台，并提供多语言支持。",
  "同步全部笔记(覆盖远端)": "同步全部笔记(覆盖远端)",
  "同步全部笔记": "同步全部笔记",
  "远端": "远端",
  "接口配置信息已经粘贴到设置中!": "接口配置信息已经粘贴到设置中!",
  "未检测到配置信息!": "未检测到配置信息!",
  "远端服务搭建与选择": "远端服务搭建与选择",
  "选择一个适合自己的远端": "选择一个适合自己的远端",
  "方式": "方式",
  "说明": "说明",
  "详情参考": "详情参考",
  "私有服务搭建": "私有服务搭建",
  "速度好, 自由配置, 无隐私风险": "速度好, 自由配置, 无隐私风险",
  "粘贴的远端配置": "粘贴的远端配置",
  "启用自动同步": "启用自动同步",
  "启动自动同步": "启动自动同步",
  "关闭后您的笔记将不做任何同步": "关闭后您的笔记将不做任何同步",
  "远端服务地址": "远端服务地址",
  "选择一个 Fast note sync service 服务地址": "选择一个 Fast note sync service 服务地址",
  "输入您的 Fast note sync service 服务地址": "输入您的 Fast note sync service 服务地址",
  "远端服务令牌": "远端服务令牌",
  "用于远端服务的访问授权令牌": "用于远端服务的访问授权令牌",
  "输入您的 API 访问令牌": "输入您的 API 访问令牌",
  "远端仓库名": "远端仓库名",
  "支持": "支持",
  "捐赠": "捐赠",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "如果您喜欢这个插件，请考虑捐赠以支持继续开发。",
  "Buy me a coffee at ko-fi.com": "在 ko-fi.com 请我喝一杯咖啡",
  "复制 Debug 信息": "复制 Debug 信息",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "将调试信息复制到剪贴板, 可能包含敏感信!",
  "开启日志": "开启日志",
  "开启后将在控制台打印日志": "开启后将在控制台打印日志",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志",
  "服务已连接": "服务已连接",
  "服务已断开": "服务已断开",
  "开始同步": "开始同步",
  "同步完成": "同步完成",
  "关闭自动同步": "关闭自动同步",
  "服务端版本": "服务端版本",
}


export default zh_cn;
