// 繁体中文
import type { LangMap } from "../lang";


const zh_tw: Partial<LangMap> = {
  "Fast sync": "專注為使用者提供無打擾、絲般順滑、多端即時同步的筆記同步插件，支持 Mac、Windows、Android、iOS 等平台，並提供多語言支持。",
  "同步全部笔记(覆盖远端)": "同步全部筆記(覆蓋遠端)",
  "同步全部笔记": "同步全部筆記",
  "远端": "遠端",
  "接口配置信息已经粘贴到设置中!": "介面配置信息已經粘貼到設置中!",
  "未检测到配置信息!": "未檢測到配置信息!",
  "远端服务搭建与选择": "遠端服務搭建與選擇",
  "选择一个适合自己的远端": "選擇一個適合自己的遠端",
  "方式": "方式",
  "说明": "說明",
  "详情参考": "詳情參考",
  "私有服务搭建": "私人服務建置",
  "速度好, 自由配置, 无隐私风险": "速度好，自由配置，無隱私風險",
  "粘贴的远端配置": "黏貼的遠端配置",
  "启用同步": "啟用同步",
  "关闭后您的笔记将不做任何同步": "關閉後您的筆記將不做任何同步",
  "远端服务地址": "遠端服務地址",
  "选择一个 Fast note sync service 服务地址": "選擇一個 Fast note sync service 服務地址",
  "输入您的 Fast note sync service 服务地址": "輸入您的 Image API Gateway 地址",
  "远端服务令牌": "遠端服務令牌",
  "用于远端服务的访问授权令牌": "用於遠端服務的訪問授權令牌",
  "输入您的 API 访问令牌": "請輸入您的 API 訪問令牌",
  "远端仓库名": "遠端倉庫名",
  "支持": "支持",
  "捐赠": "捐贈",
  "如果您喜欢这个插件，请考虑捐赠以支持继续开发。": "如果您喜歡這個插件，請考慮捐贈以支持繼續開發。",
  "Buy me a coffee at ko-fi.com": "在 ko-fi.com 請我喝杯咖啡。",
  "复制 Debug 信息": "複製 Debug 信息",
  "将调试信息复制到剪贴板, 可能包含敏感信!": "將調試信息複製到剪貼板，可能包含敏感信!",
  "通过快捷键打开控制台，你可以看到这个插件和其他插件的日志": "透過快捷鍵開啟控制台，你可以看到這個插件和其他插件的日誌",
  "开始同步": "開始同步",
  "同步完成": "同步完成",
}


export default zh_tw;
